app/Http/Controllers/Vendor/DashboardController.php

    public function index()
    {
        $vendorId = auth()->id();

        $totalMenu = \App\Models\Menu::where("vendor_id", $vendorId)->count();

        $pengirimanAktif = \App\Models\Distribusi::where("vendor_id", $vendorId)
            ->where("status", "Dikirim")
            ->count();

        $totalDiterima = \App\Models\Distribusi::where("vendor_id", $vendorId)
            ->where("status", "Diterima")
            ->count();

        $totalKomplain = \App\Models\Distribusi::where("vendor_id", $vendorId)
            ->where("status", "Komplain")
            ->count();

        $distribusiTerbaru = \App\Models\Distribusi::with(["menu"])
            ->where("vendor_id", $vendorId)
            ->latest()
            ->take(5)
            ->get();
---
select count(*) as aggregate from `menus` where `vendor_id` = 3
select count(*) as aggregate from `distribusis` where `vendor_id` = 3 and `status` = 'Dikirim'
select count(*) as aggregate from `distribusis` where `vendor_id` = 3 and `status` = 'Diterima'
select count(*) as aggregate from `distribusis` where `vendor_id` = 3 and `status` = 'Komplain'
select * from `distribusis` where `vendor_id` = 3 order by `created_at` desc limit 5
select * from `menus` where `menus`.`id` in (1)