app/Http/Controllers/Vendor/MenuController.php

select * from `menus` where `vendor_id` = 3 order by `created_at` desc
---
    public function index()
    {
        $menus = Menu::latest()->get();