app/Http/Controllers/DistribusiController.php

    public function index()
    {
        $distribusis = Distribusi::paginate(10);
---
select * from `distribusis` limit 10 offset 0
select count(*) as aggregate from `distribusis`

    public function store(Request $request)
    {
        $request->validate([
            "sekolah_tujuan" => "required|string|max:255",
            "jumlah_porsi" => "required|integer|min:1",
            "tanggal_pengiriman" => "required|date",
        ]);

        Distribusi::create([
            "sekolah_tujuan" => $request->sekolah_tujuan,
            "jumlah_porsi" => $request->jumlah_porsi,
            "tanggal_pengiriman" => $request->tanggal_pengiriman,
            "status" => "Di Perjalanan",
        ]);
---
insert into `distribusis` (`sekolah_id`, `vendor_id`, `menu_id`, `sekolah_tujuan`, `jumlah_porsi`, `tanggal_pengiriman`, `status`, `updated_at`, `created_at`) values ('1', null, null, 'SMPN 15 Jakarta', '77', '2026-06-10', 'Dikirim', '2026-06-09 17:36:29', '2026-06-09 17:36:29')

    public function edit($id)
    {
        $distribusi = Distribusi::findOrFail($id);
---
select * from `distribusis` where `distribusis`.`id` = '13' limit 1

    public function update(Request $request, $id)
    {
        $request->validate([
            "tanggal_pengiriman" => "required|date",
            "sekolah_tujuan" => "required|string|max:255",
            "jumlah_porsi" => "required|integer|min:1",
            "status" => "required|string",
            "alasan_perubahan" => "nullable|string|max:500",
        ]);

        $distribusi = Distribusi::findOrFail($id);

        // PBI-35: Catat request change jika jumlah porsi berubah
        if ($distribusi->jumlah_porsi != $request->jumlah_porsi) {
            RequestChange::create([
                "distribusi_id" => $distribusi->id,
                "jumlah_porsi_awal" => $distribusi->jumlah_porsi,
                "jumlah_porsi_baru" => $request->jumlah_porsi,
                "alasan" => $request->alasan_perubahan ?? "Tidak ada alasan",
            ]);
---
select * from `distribusis` where `distribusis`.`id` = '13' limit 1
insert into `request_changes` (`distribusi_id`, `jumlah_porsi_awal`, `jumlah_porsi_baru`, `alasan`, `updated_at`, `created_at`) values (13, 11, '1100', 'kurang', '2026-06-09 17:40:08', '2026-06-09 17:40:08')

    public function riwayat(Request $request)
    {
        $tanggal = $request->query("tanggal", now()->toDateString());

        $distribusis = Distribusi::with("requestChanges")
            ->whereDate("tanggal_pengiriman", $tanggal)
            ->orderBy("updated_at", "desc")
            ->get();

        $summary = [
            "total_pengiriman" => $distribusis->count(),
            "total_porsi" => $distribusis->sum("jumlah_porsi"),
            "diterima" => $distribusis
                ->whereIn("status", ["Diterima", "Diterima Sebagian"])
                ->count(),
            "di_perjalanan" => $distribusis
                ->whereIn("status", ["Di Perjalanan", "Dikirim"])
                ->count(),
            "kendala" => $distribusis->where("status", "Kendala")->count(),
            "pending" => $distribusis->where("status", "Pending")->count(),
        ];
---
select * from `request_changes` where `request_changes`.`distribusi_id` in (6, 7, 8, 9, 10, 11)
select * from `distribusis` where date(`tanggal_pengiriman`) = '2026-06-09' order by `updated_at` desc

    public function apiIndex()
    {
        $distribusis = Distribusi::select(
            "id",
            "sekolah_tujuan",
            "jumlah_porsi",
            "tanggal_pengiriman",
            "status",
            "latitude",
            "longitude",
            "last_updated",
        )->get();
---
select `id`, `sekolah_tujuan`, `jumlah_porsi`, `tanggal_pengiriman`, `status`, `latitude`, `longitude`, `last_updated` from `distribusis`