app/Http/Controllers/Admin/AnalyticsController.php

select count(*) as aggregate from `distribusis` where date(`tanggal_pengiriman`) = '2026-06-10'
select count(*) as aggregate from `distribusis`
select count(distinct `sekolah_tujuan`) as aggregate from `distribusis`
select sum(`jumlah_porsi`) as aggregate from `distribusis`
select count(*) as aggregate from `distribusis` where `status` = 'Pending'
select count(*) as aggregate from `distribusis` where `status` in ('Diterima', 'Diterima Sebagian')
---
    public function summary()
    {
<<<<<<< HEAD
        return response()->json([
            'total_distribusi'  => Distribusi::count(),
            'distribusi_hari_ini' => Distribusi::whereDate('tanggal_pengiriman', now()->toDateString())->count(),
            'distribusi_pending'  => Distribusi::where('status', 'Pending')->count(),
            'total_porsi'       => Distribusi::sum('jumlah_porsi'),

            // PBI-24 Advanced Metrics
            'total_sekolah' => Distribusi::distinct('sekolah_tujuan')->count('sekolah_tujuan'),
            'avg_porsi'     => round(Distribusi::avg('jumlah_porsi'), 1),
            'success_rate'  => Distribusi::count() > 0
                ? round((Distribusi::whereIn('status', ['Terkirim', 'Diterima', 'Diterima Sebagian'])->count() / Distribusi::count()) * 100, 1)
                : 0,
            'total_kendala' => Distribusi::where('status', 'Kendala')->count(),
=======
        $totalDistribusi = Distribusi::count();
        $distribusiHariIni = Distribusi::whereDate(
            "tanggal_pengiriman",
            today(),
        )->count();
        $distribusiPending = Distribusi::where("status", "Pending")->count();
        $distribusiDikirim = Distribusi::where("status", "Dikirim")->count();
        $totalPorsi = Distribusi::sum("jumlah_porsi");

select `status`, count(*) as count from `distribusis` group by `status`
select DATE(tanggal_pengiriman) as date, count(*) as count from `distribusis` group by `date` order by `date` desc limit 7
select `sekolah_tujuan`, SUM(jumlah_porsi) as total_porsi from `distribusis` group by `sekolah_tujuan` order by `total_porsi` desc limit 5
select `sekolah_tujuan`, count(*) as total_kendala from `distribusis` where `status` = 'Kendala' group by `sekolah_tujuan` order by `total_kendala` desc limit 5
---
    public function chartData()
    {
<<<<<<< HEAD
        // 1. Status Chart Data
        $statusChart = Distribusi::select('status', DB::raw('count(*) as count'))
            ->groupBy('status')
            ->pluck('count', 'status');

        // 2. Daily Trend Data (Last 7 Days)
        $dailyChart = Distribusi::selectRaw('DATE(tanggal_pengiriman) as date, count(*) as count')
            ->groupBy('date')
            ->orderBy('date', 'desc')
            ->limit(7)
            ->get()
            ->reverse()
            ->values();

        // 3. Top 5 Schools by Volume
        $topSchools = Distribusi::select('sekolah_tujuan', DB::raw('SUM(jumlah_porsi) as total_porsi'))
            ->groupBy('sekolah_tujuan')
            ->orderBy('total_porsi', 'desc')
            ->limit(5)
            ->get();

        // 4. Top 5 Schools with Issues (Kendala)
        $topIssues = Distribusi::select('sekolah_tujuan', DB::raw('count(*) as total_kendala'))
            ->where('status', 'Kendala')
            ->groupBy('sekolah_tujuan')
            ->orderBy('total_kendala', 'desc')
            ->limit(5)
            ->get();