app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `distribusis`
select count(*) as aggregate from `users` where `role` = 'vendor'
select count(*) as aggregate from `users` where `role` = 'sekolah'
select * from `distribusis` order by `created_at` desc limit 5
---
    public function index()
    {
        $totalDistribusi = \App\Models\Distribusi::count();
        $totalVendor = \App\Models\User::where("role", "vendor")->count();
        $totalSekolah = \App\Models\User::where("role", "sekolah")->count();

        $distribusiTerbaru = \App\Models\Distribusi::latest()->take(5)->get();