app/Http/Controllers/Admin/DistributionController.php

    public function index()
    {
        $distributions = Distribusi::with(['feedbacks', 'requestChanges'])
            ->latest()
            ->paginate(10);
---
select * from `distribusis` limit 10 offset 0
select * from `feedbacks` where `feedbacks`.`distribusi_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select count(*) as aggregate from `distribusis`