app/Http/Controllers/Admin/UserController.php

    public function index()
    {
        $authId = auth()->id();

        $users = User::where(function ($query) use ($authId) {
            $query->whereIn('role', ['vendor', 'sekolah'])
                  ->orWhere('id', $authId);
        })
        ->orderByRaw("CASE WHEN id = ? THEN 0 ELSE 1 END", [$authId])
        ->latest()
        ->paginate(10);
---
select * from `users` where (`role` in ('vendor', 'sekolah') or `id` = 2) order by CASE WHEN id = 2 THEN 0 ELSE 1 END, `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users` where (`role` in ('vendor', 'sekolah') or `id` = 2)

    public function store(Request $request)
    {
        $validated = $request->validate([
            'name'     => 'required|string|max:255',
            'email'    => 'required|email|unique:users,email',
            'role'     => 'required|in:vendor,sekolah',
            'password' => ['required', 'confirmed', Password::min(8)],
        ]);

        User::create([
            'name'     => $validated['name'],
            'email'    => $validated['email'],
            'role'     => $validated['role'],
            'password' => Hash::make($validated['password']),
        ]);
---
insert into `users` (`name`, `email`, `role`, `password`, `updated_at`, `created_at`) values ('Sman 3 Cibinong', 'sman3cibinong@sch.id', 'sekolah', '$2y$12$QQg81A5VwoPqBBW.hEwX1.P7cx269WPhx/738IF6VUo5ihDtsVJJ6', '2026-06-10 12:44:03', '2026-06-10 12:44:03')